RT-Thread/rt-thread/bsp/freescale/platform/devices/MK20D10/include/MK20D10_extension.h
/*! @brief Set the OVRF field to a new value. */
#define TSI_WR_GENCS_OVRF(base, value) (TSI_RMW_GENCS(base, (TSI_GENCS_OVRF_MASK | TSI_GENCS_EXTERF_MASK | TSI_GENCS_OUTRGF_MASK | TSI_GENCS_EOSF_MASK), TSI_GENCS_OVRF(value)))
#define TSI_BWR_GENCS_OVRF(base, value) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_OVRF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field EXTERF[13] (W1C)
 *
 * This flag is set when an active electrode has a result register either 0x0000
 * or 0xFFFF. Writing 1 to this bit will clear the flag to 0.
 *
 * Values:
 * - 0b0 - No fault happend on TSI electrodes.
 * - 0b1 - Short to VDD or VSS was detected on one or more electrodes.
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_EXTERF field. */
#define TSI_RD_GENCS_EXTERF(base) ((TSI_GENCS_REG(base) & TSI_GENCS_EXTERF_MASK) >> TSI_GENCS_EXTERF_SHIFT)
#define TSI_BRD_GENCS_EXTERF(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_EXTERF_SHIFT))

/*! @brief Set the EXTERF field to a new value. */
#define TSI_WR_GENCS_EXTERF(base, value) (TSI_RMW_GENCS(base, (TSI_GENCS_EXTERF_MASK | TSI_GENCS_OVRF_MASK | TSI_GENCS_OUTRGF_MASK | TSI_GENCS_EOSF_MASK), TSI_GENCS_EXTERF(value)))
#define TSI_BWR_GENCS_EXTERF(base, value) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_EXTERF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field OUTRGF[14] (W1C)
 *
 * This flag is set if the result register of the low-power enabled electrode is
 * outside the range defined by the TSI_THRESHOLD register. This flag is set
 * only when the TSI is in low-power mode. It can be read after the CPU wakes up.
 * Writing 1 to this bit will clear the flag to 0.
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_OUTRGF field. */
#define TSI_RD_GENCS_OUTRGF(base) ((TSI_GENCS_REG(base) & TSI_GENCS_OUTRGF_MASK) >> TSI_GENCS_OUTRGF_SHIFT)
#define TSI_BRD_GENCS_OUTRGF(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_OUTRGF_SHIFT))

/*! @brief Set the OUTRGF field to a new value. */
#define TSI_WR_GENCS_OUTRGF(base, value) (TSI_RMW_GENCS(base, (TSI_GENCS_OUTRGF_MASK | TSI_GENCS_OVRF_MASK | TSI_GENCS_EXTERF_MASK | TSI_GENCS_EOSF_MASK), TSI_GENCS_OUTRGF(value)))
#define TSI_BWR_GENCS_OUTRGF(base, value) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_OUTRGF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field EOSF[15] (W1C)
 *
 * This flag is set when all active electrodes are scanned is ended after a scan
 * trigger. Writing 1 to this bit will clear the flag to 0.
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_EOSF field. */
#define TSI_RD_GENCS_EOSF(base) ((TSI_GENCS_REG(base) & TSI_GENCS_EOSF_MASK) >> TSI_GENCS_EOSF_SHIFT)
#define TSI_BRD_GENCS_EOSF(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_EOSF_SHIFT))

/*! @brief Set the EOSF field to a new value. */
#define TSI_WR_GENCS_EOSF(base, value) (TSI_RMW_GENCS(base, (TSI_GENCS_EOSF_MASK | TSI_GENCS_OVRF_MASK | TSI_GENCS_EXTERF_MASK | TSI_GENCS_OUTRGF_MASK), TSI_GENCS_EOSF(value)))
#define TSI_BWR_GENCS_EOSF(base, value) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_EOSF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field PS[18:16] (RW)
 *
 * This field can be changed only if the TSI module is disabled (TSIEN bit = 0)
 *
 * Values:
 * - 0b000 - Electrode Oscillator Frequency divided by 1
 * - 0b001 - Electrode Oscillator Frequency divided by 2
 * - 0b010 - Electrode Oscillator Frequency divided by 4
 * - 0b011 - Electrode Oscillator Frequency divided by 8
 * - 0b100 - Electrode Oscillator Frequency divided by 16
 * - 0b101 - Electrode Oscillator Frequency divided by 32
 * - 0b110 - Electrode Oscillator Frequency divided by 64
 * - 0b111 - Electrode Oscillator Frequency divided by 128
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_PS field. */
#define TSI_RD_GENCS_PS(base) ((TSI_GENCS_REG(base) & TSI_GENCS_PS_MASK) >> TSI_GENCS_PS_SHIFT)
#define TSI_BRD_GENCS_PS(base) (TSI_RD_GENCS_PS(base))

/*! @brief Set the PS field to a new value. */
#define TSI_WR_GENCS_PS(base, value) (TSI_RMW_GENCS(base, (TSI_GENCS_PS_MASK | TSI_GENCS_OVRF_MASK | TSI_GENCS_EXTERF_MASK | TSI_GENCS_OUTRGF_MASK | TSI_GENCS_EOSF_MASK), TSI_GENCS_PS(value)))
#define TSI_BWR_GENCS_PS(base, value) (TSI_WR_GENCS_PS(base, value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field NSCN[23:19] (RW)
 *
 * This field can be changed only if the TSI module is disabled (TSIEN bit = 0).
 *
 * Values:
 * - 0b00000 - Once per electrode.
 * - 0b00001 - Twice per electrode.
 * - 0b00010 - 3 times per electrode.
 * - 0b00011 - 4 times per electrode.
 * - 0b00100 - 5 times per electrode.
 * - 0b00101 - 6 times per electrode.
 * - 0b00110 - 7 times per electrode.
 * - 0b00111 - 8 times per electrode.
 * - 0b01000 - 9 times per electrode.
 * - 0b01001 - 10 times per electrode.
 * - 0b01010 - 11 times per electrode.
 * - 0b01011 - 12 times per electrode.
 * - 0b01100 - 13 times per electrode.
 * - 0b01101 - 14 times per electrode.
 * - 0b01110 - 15 times per electrode.
 * - 0b01111 - 16 times per electrode.
 * - 0b10000 - 17 times per electrode.
 * - 0b10001 - 18 times per electrode.
 * - 0b10010 - 19 times per electrode.
 * - 0b10011 - 20 times per electrode.
 * - 0b10100 - 21 times per electrode.
 * - 0b10101 - 22 times per electrode.
 * - 0b10110 - 23 times per electrode.
 * - 0b10111 - 24 times per electrode.
 * - 0b11000 - 25 times per electrode.
 * - 0b11001 - 26 times per electrode.
 * - 0b11010 - 27 times per electrode.
 * - 0b11011 - 28 times per electrode.
 * - 0b11100 - 29 times per electrode.
 * - 0b11101 - 30 times per electrode.
 * - 0b11110 - 31 times per electrode.
 * - 0b11111 - 32 times per electrode.
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_NSCN field. */
#define TSI_RD_GENCS_NSCN(base) ((TSI_GENCS_REG(base) & TSI_GENCS_NSCN_MASK) >> TSI_GENCS_NSCN_SHIFT)
#define TSI_BRD_GENCS_NSCN(base) (TSI_RD_GENCS_NSCN(base))

/*! @brief Set the NSCN field to a new value. */
#define TSI_WR_GENCS_NSCN(base, value) (TSI_RMW_GENCS(base, (TSI_GENCS_NSCN_MASK | TSI_GENCS_OVRF_MASK | TSI_GENCS_EXTERF_MASK | TSI_GENCS_OUTRGF_MASK | TSI_GENCS_EOSF_MASK), TSI_GENCS_NSCN(value)))
#define TSI_BWR_GENCS_NSCN(base, value) (TSI_WR_GENCS_NSCN(base, value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field LPSCNITV[27:24] (RW)
 *
 * This field can be changed only if the TSI module is disabled (TSIEN bit = 0).
 *
 * Values:
 * - 0b0000 - 1 ms scan interval
 * - 0b0001 - 5 ms scan interval
 * - 0b0010 - 10 ms scan interval
 * - 0b0011 - 15 ms scan interval
 * - 0b0100 - 20 ms scan interval
 * - 0b0101 - 30 ms scan interval
 * - 0b0110 - 40 ms scan interval
 * - 0b0111 - 50 ms scan interval
 * - 0b1000 - 75 ms scan interval
 * - 0b1001 - 100 ms scan interval
 * - 0b1010 - 125 ms scan interval
 * - 0b1011 - 150 ms scan interval
 * - 0b1100 - 200 ms scan interval
 * - 0b1101 - 300 ms scan interval
 * - 0b1110 - 400 ms scan interval
 * - 0b1111 - 500 ms scan interval
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_LPSCNITV field. */
#define TSI_RD_GENCS_LPSCNITV(base) ((TSI_GENCS_REG(base) & TSI_GENCS_LPSCNITV_MASK) >> TSI_GENCS_LPSCNITV_SHIFT)
#define TSI_BRD_GENCS_LPSCNITV(base) (TSI_RD_GENCS_LPSCNITV(base))

/*! @brief Set the LPSCNITV field to a new value. */
#define TSI_WR_GENCS_LPSCNITV(base, value) (TSI_RMW_GENCS(base, (TSI_GENCS_LPSCNITV_MASK | TSI_GENCS_OVRF_MASK | TSI_GENCS_EXTERF_MASK | TSI_GENCS_OUTRGF_MASK | TSI_GENCS_EOSF_MASK), TSI_GENCS_LPSCNITV(value)))
#define TSI_BWR_GENCS_LPSCNITV(base, value) (TSI_WR_GENCS_LPSCNITV(base, value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field LPCLKS[28] (RW)
 *
 * This field can be changed only if the TSI module is disabled (TSIEN bit = 0).
 *
 * Values:
 * - 0b0 - LPOCLK is selected to determine the scan period in low-power mode.
 * - 0b1 - VLPOSCCLK is selected to determine the scan period in low-power mode.
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_LPCLKS field. */
#define TSI_RD_GENCS_LPCLKS(base) ((TSI_GENCS_REG(base) & TSI_GENCS_LPCLKS_MASK) >> TSI_GENCS_LPCLKS_SHIFT)
#define TSI_BRD_GENCS_LPCLKS(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_LPCLKS_SHIFT))

/*! @brief Set the LPCLKS field to a new value. */
#define TSI_WR_GENCS_LPCLKS(base, value) (TSI_RMW_GENCS(base, (TSI_GENCS_LPCLKS_MASK | TSI_GENCS_OVRF_MASK | TSI_GENCS_EXTERF_MASK | TSI_GENCS_OUTRGF_MASK | TSI_GENCS_EOSF_MASK), TSI_GENCS_LPCLKS(value)))
#define TSI_BWR_GENCS_LPCLKS(base, value) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_LPCLKS_SHIFT) = (value))
/*@}*/

